{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0001876",
            "nameText": {
                "text": "Catherine Zeta-Jones"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm2796831232",
                "url": "https://m.media-amazon.com/images/M/MV5BODVhZDJmNWItMGVkNS00YjMxLThkMGItYWE5ZDAwMTBiYTVlXkEyXkFqcGc@._V1_.jpg",
                "height": 819,
                "width": 975
            },
            "bio": {
                "id": "mb0039590",
                "text": {
                    "plainText": "Catherine Zeta-Jones was born September 25, 1969 in Swansea, Wales (and raised in the nearby town of Mumbles), the only daughter of Patricia (nee Fair) and David James \"Dai\" Jones, who formerly owned a sweet factory. She attended Dumbarton House School (Swansea). Her father (the son of Bertram (1912-1970) and Zeta Davies Jones (1917-2008)) is of Welsh descent and her mother (the daughter of William (1921-2000) and Catherine O'Callaghan Fair (1920-2001) ) is of English, Irish, and Welsh ancestry. Her brothers are David Jones (born 1967), a development executive, and Lyndon Jones (born 1972), who works at her production company. Her birth name was simply Catherine Jones, but she added her paternal grandmother's name (\"Zeta\") so as to stand out from the many other young women with the exact same name.\n\nShe showed an interest early on in entertainment. She starred on stage in \"Annie\", \"Bugsy Malone\" and \"The Pajama Game\". At age 15, she had the lead in the British revival of \"42nd Street\". She was originally cast as the second understudy for the lead role in the musical but when the star and first understudy became sick the night the play's producer was in the audience, she was given the lead for the rest of the musical's production. She first made a name for herself in the early 1990s when she starred in the Yorkshire Television comedy/drama series The Darling Buds of May (1991). The series was a success and made her one of the United Kingdom's most popular television actresses.\n\nShe subsequently played supporting roles in several films including Christopher Columbus: The Discovery (1992), the miniseries Catherine the Great (1995) and a larger role as the seductive Sala in The Phantom (1996) before landing her breakthrough role playing the fiery Elena opposite Anthony Hopkins and Antonio Banderas in The Mask of Zorro (1998). She starred in many big-budget blockbusters like Entrapment (1999), The Haunting (1999) and Traffic (2000), for which many believed she was robbed of an Oscar nomination for best supporting actress. She won an Academy Award for Best Supporting Actress as murderous vaudevillian Velma Kelly in the musical comedy Chicago (2002). She then appeared opposite George Clooney in Intolerable Cruelty (2003), Ocean's Twelve (2004) and reprised her starring role in the sequel The Legend of Zorro (2005).\n\nIn November 2000, she married actor Michael Douglas. She gave birth to their son Dylan Michael in August 2000 followed by daughter, Carys, in April 2003. She was awarded Commander of the Order of the British Empire in the 2010 Queen's Birthday Honours List for her services to drama."
                }
            }
        }
    }
}