{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000234",
            "nameText": {
                "text": "Charlize Theron"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm2942012672",
                "url": "https://m.media-amazon.com/images/M/MV5BMTk5Mzc4ODU0Ml5BMl5BanBnXkFtZTcwNjU1NTI0Mw@@._V1_.jpg",
                "height": 400,
                "width": 300
            },
            "bio": {
                "id": "mb0035360",
                "text": {
                    "plainText": "Charlize Theron was born in Benoni, a city in the greater Johannesburg area, in South Africa, the only child of Gerda Theron (née Maritz) and Charles Theron. She was raised on a farm outside the city. Theron is of Afrikaner (Dutch, with some French Huguenot and German) descent, and Afrikaner military figure Danie Theron was her great-great-uncle.\n\nTheron received an education as a ballet dancer and has danced both the \"Swan Lake\" and \"The Nutcracker\". There was not much work for a young actress or dancer in South Africa, so she soon traveled to Europe and the United States, where she got a job at the Joffrey Ballet in New York. She was also able to work as a photo model. However, an injured knee put a halt to her dancing career.\n\nIn 1994, her mother bought her a one-way ticket to Los Angeles, and Charlize started visiting all of the agents on Hollywood Boulevard, but without any luck. She went to a bank to cash a check for $500 she received from her mother, and became furious when she learned that the bank would not cash it because it was an out-of-state check. She made a scene and an agent gave her his card, in exchange for learning American English, which she did by watching soap operas on television.\n\nHer first role was in the B-film Children of the Corn III: Urban Harvest (1995), a non-speaking part with three seconds of screen time. Her next role was as Helga Svelgen in 2 Days in the Valley (1996), which landed her the role of Tina Powers in That Thing You Do! (1996). Since then, she has starred in movies like The Devil's Advocate (1997), Mighty Joe Young (1998), The Cider House Rules (1999), The Legend of Bagger Vance (2000) and The Italian Job (2003). On February 29, 2004, she won her first Academy Award, a Best Actress Oscar for her performance in Monster (2003)."
                }
            }
        }
    }
}