{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0654110",
            "nameText": {
                "text": "Clive Owen"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm2045348608",
                "url": "https://m.media-amazon.com/images/M/MV5BMjA4MzAyOTc5Ml5BMl5BanBnXkFtZTcwOTQ5NzEzMg@@._V1_.jpg",
                "height": 400,
                "width": 303
            },
            "bio": {
                "id": "mb0175187",
                "text": {
                    "plainText": "British actor Clive Owen is one of a handful of stars who, though he is best known for his art house films, can handle more mainstream films with equal measures of grace and skill. Owen is typically cast as characters whose primary traits are a balance of physical strength, intellect, conflicting soul but forceful will. He is best known to film audiences for his work in Children of Men (2006), Closer (2004) and his breakout part in Croupier (1998).\n\nBorn in Coventry, in England's West Midlands county, on 3 October 1964, Owen is the fourth of five brothers. He is the son of Pamela (Cotton) and Jess Owen, a country and western singer. His father abandoned the family when he was three years old, and Owen was subsequently raised by his mother and stepfather. He attended Binley Park Comprehensive School and joined the youth theater at 13 after playing the scene-stealing role of the Artful Dodger in a production of \"Oliver!\"\n\nActing was not his first choice as a profession, but he changed his mind and went on to graduate from the Royal Academy of Dramatic Art in 1987. Owen proceeded to join the Young Vic Theatre Company, where he honed his craft while performing in a number of Shakespearean productions.\n\nClive made his film debut in the British-made Vroom (1990) co-starring with David Thewlis as two fellows who restore a classic American car and take off on the road. Within two years, Clive became a full-fledged TV star playing devilish rogue Stephen Crane in Chancer (1990). However, the now-sought-after Clive abandoned the star-making part at the height of the show's popularity because of unwanted invasion of privacy and his fear of typecasting. His next project raised more than a few eyebrows when he filmed Close My Eyes (1991) in which he played a brother who acts on his incestuous desires for his older sister. Clive's reputation as a lovable shyster was completely shattered and he lost profitable commercial endorsements following the film's release. Offers fell off for the next two years as a result. But the persistent Clive carried on with stage work, including the role of a bisexual in a production of Noël Coward's \"Design For Living.\" He returned to TV at that time as well and played a number of roles in both mini-movies and series.\n\nIn 1997, Clive had a huge hit on the London stage with \"Closer,\" a cynical, contemporary ensemble piece about relationships. Controversy surrounded him again in the film role of Max in Bent (1997) playing a brash, reckless homosexual lothario in decadent pre-war Germany who finds unconditional love while interned in a Nazi war camp. His biggest film break, however, was in Mike Hodges' Croupier (1998), as a struggling writer-turned-casino employee who gets in over his head with a femme fatale scam artist. English audiences stayed away in droves but the U.S. embraced the film and Hollywood took notice of Clive, who was virtually unknown outside of England. Despite playing detective Ross Tanner in a series of successful \"Second Sight\" mini-movies and finding critical acclaim on stage with \"The Day in the Death of Joe Egg\" in 2001, Clive has focused primarily on film, including the offbeat Brit romantic comedy Greenfingers (2000), the classy and popular Robert Altman period piece Gosford Park (2001), the Matt Damon star-vehicle The Bourne Identity (2002), and the title role in King Arthur (2004). He has since reached the top rungs of the Hollywood ladder with the film version of his stage smash Closer (2004), in which he received an Academy Award nomination and won both the Golden Globe and BAFTA awards for \"Supporting Actor.\" He also had noteworthy roles opposite Denzel Washington in Inside Man (2006); and Julianne Moore and Michael Caine in Children of Men (2006), as well as handling a few biopics, playing Sir Walter Raleigh opposite Cate Blanchett's Elizabeth I in the film Elizabeth: The Golden Age (2007) and Ernest Hemingway (Emmy nomination) in Hemingway & Gellhorn (2012) also starring Nicole Kidman.\n\nMore recent films include starring roles in The International (2009), Duplicity (2009), The Boys Are Back (2009), Trust (2010), Intruders (2011), Blood Ties (2013), Last Knights (2015), The Confirmation (2016) and Anon (2018). He also played Claudius in a retelling of \"Hamlet\" per Ophelia's perspective in Ophelia (2018); and played in support to Will Smith in the sci-fi thriller Gemini Man (2019).\n\nOwen is married to former actress Sarah-Jane Fenton, who played Juliet to his Romeo at the Young Vic in 1998. The couple has two daughters."
                }
            }
        }
    }
}