{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000123",
            "nameText": {
                "text": "George Clooney"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm3196301568",
                "url": "https://m.media-amazon.com/images/M/MV5BMjEyMTEyOTQ0MV5BMl5BanBnXkFtZTcwNzU3NTMzNw@@._V1_.jpg",
                "height": 2048,
                "width": 1507
            },
            "bio": {
                "id": "mb0174196",
                "text": {
                    "plainText": "George Timothy Clooney was born on May 6, 1961, in Lexington, Kentucky, to Nina Bruce (née Warren), a former beauty pageant queen, and Nick Clooney, a former anchorman and television host (who was also the brother of singer Rosemary Clooney). He has Irish, English, and German ancestry. Clooney spent most of his youth in Ohio and Kentucky, and graduated from Augusta High School. He was very active in sports such as basketball and baseball, and tried out for the Cincinnati Reds, but was not offered a contract.\n\nAfter his cousin, Miguel Ferrer, got him a small role in a feature film, Clooney began to pursue acting. His first major role was on the sitcom E/R (1984) as Ace. More roles soon followed, including George Burnett, the handsome handyman on The Facts of Life (1979); Booker Brooks, a supervisor on Roseanne (1988); and Detective James Falconer on Sisters (1991). Clooney had his breakthrough when he was cast as Dr. Doug Ross on the award-winning drama series ER (1994), opposite Anthony Edwards, Noah Wyle and Julianna Margulies.\n\nWhile filming \"ER\" (1994), Clooney starred in a number of high profile film roles, such as Robert Rodriguez's From Dusk Till Dawn (1996), and One Fine Day (1996), opposite Michelle Pfeiffer. In 1997, Clooney took on the role of Batman in Joel Schumacher's Batman & Robin (1997). The film was a moderate success in the box office, but was slammed by critics, notably for the nipple-laden Batsuit. Clooney went on to star in Steven Soderbergh's Out of Sight (1998), Terrence Malick's The Thin Red Line (1998), and David O. Russell's Three Kings (1999).\n\nIn 1999, Clooney left \"ER\" (1994) (though he would return for the season finale) and appeared in a number of films, including O Brother, Where Art Thou? (2000), The Perfect Storm (2000) and Ocean's Eleven (2001). Collaborating once again with Steven Soderbergh, Ocean's Eleven (2001) received critical acclaim, earned more than $450 million at the box office, and spawned two sequels: Ocean's Twelve (2004) and Ocean's Thirteen (2007).\n\nIn 2002, Clooney made his directorial debut with Confessions of a Dangerous Mind (2002), an adaptation of TV producer Chuck Barris' autobiography. This was the first film under the banner of Section Eight Productions, a production company he founded with Steven Soderbergh. The company also produced many acclaimed films, including Far from Heaven (2002), Syriana (2005), A Scanner Darkly (2006) and Good Night, and Good Luck. (2005). Clooney won his first Oscar for Best Supporting Actor in Syriana (2005), and was nominated for Best Director and Best Original Screenplay for Good Night, and Good Luck. (2005).\n\nIn 2006, Section Eight Productions was shut down so that Soderbergh could concentrate on directing, and Clooney founded a new production company, Smokehouse Productions, with his friend and longtime business partner, Grant Heslov.\n\nClooney went on to produce and star in Michael Clayton (2007) (which earned him an Oscar nomination for Best Actor), directed and starred in Leatherheads (2008), and took leading roles in Burn After Reading (2008), The Men Who Stare at Goats (2009), Fantastic Mr. Fox (2009), and Jason Reitman's Up in the Air (2009). Clooney received critical acclaim for his performance in Up in the Air (2009) and was nominated for several awards, including a Golden Globe Award and Academy Award. He didn't win that year, but took home both Best Actor awards (as well as countless nominations) for his role as a father who finds out his wife was unfaithful as she lays in a coma in Alexander Payne's The Descendants (2011). Through his career, Clooney has been heralded for his political activism and humanitarian work. He has served as one of the United Nations Messengers of Peace since 2008, has been an advocate for the Darfur conflict, and organized the Hope for Haiti telethon, to raise money for the victims of the 2010 earthquake. In March 2012, Clooney was arrested for civil disobedience while protesting at the Sudanese embassy in Washington, D.C.\n\nClooney was married to actress Talia Balsam, from 1989 until 1993. After their divorce, he swore he would never marry again. Michelle Pfeiffer and Nicole Kidman bet him $10,000 that he would have children by the age of 40, and sent him a check shortly after his birthday. Clooney returned the funds and bet double or nothing he wouldn't have children by the age of 50. Although he has remained a consummate bachelor, Clooney has had many highly publicized relationships, including with former WWE wrestler Stacy Keibler. In 2014, he married lawyer and activist Amal Clooney, with whom he has two children, twins."
                }
            }
        }
    }
}