{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0124930",
            "nameText": {
                "text": "Gerard Butler"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm1194363136",
                "url": "https://m.media-amazon.com/images/M/MV5BMjE4NDMwMzc4Ml5BMl5BanBnXkFtZTcwMDg4Nzg4Mg@@._V1_.jpg",
                "height": 400,
                "width": 285
            },
            "bio": {
                "id": "mb0005119",
                "text": {
                    "plainText": "Gerard James Butler was born in Paisley, Scotland, to Margaret and Edward Butler, a bookmaker. His family is of Irish origin. Gerard spent some of his very early childhood in Montreal, Quebec, but was mostly raised, along with his older brother and sister, in his hometown of Paisley. His parents divorced when he was a child, and he and his siblings were raised primarily by their mother, who later remarried. He had no contact with his father between the ages of two and 16 years old, after which time they became close. His father passed away when Gerard was in his early 20s. Butler went on to attend Glasgow University, where he studied to be a lawyer/solicitor. He was president of the school's law society thanks to his outgoing personality and great social skills.\n\nHis acting career began when he was approached in a London coffee shop by actor Steven Berkoff, who later appeared alongside Butler in Attila (2001), who gave him a role in a stage production of \"Coriolanus\" (later, Butler played Tullus Aufidius in a big screen Coriolanus (2011). After that, Butler decided to give up law for acting. He was cast as Ewan McGregor's character \"Renton\" in the stage adaptation of Trainspotting. His film debut was as Billy Connolly's younger brother in Mrs. Brown (1997). While filming the movie in Scotland, he was enjoying a picnic with his mother near the River Tay when they heard the shouts of a young boy, who had been swimming with a friend, who was in some trouble. Butler jumped in and saved the young boy from drowning. He received a Certificate of Bravery from the Royal Humane Society. He felt he only did what anyone in the situation would have done.\n\nHis film career continued with small roles, first in the \"James Bond\" movie, Tomorrow Never Dies (1997), and then Russell Mulcahy's Tale of the Mummy (1998). In 2000, Butler was cast in two breakthrough roles, the first being \"Attila the Hun\" in the USA Network mini-series, Attila (2001). The film's producers wanted a known actor to play the part but kept coming back to Butler's screen tests and decided he was their man. He had to lose the thick Scottish accent, but managed well. Around the time \"Attila\" was being filmed, casting was in progress for Wes Craven's new take on the \"Dracula\" legacy. Also wanting a known name, Butler wasn't much of a consideration, but his unending tenacity drove him to hounding the producers. Eventually, he sent them a clip of his portrayal of \"Attila\". Evidently, they saw something because Dracula 2000 (2000) was cast in the form of Butler. Attila's producers, thinking that his big-screen role might help with their own film's ratings, finished shooting a little early so he could get to work on Dracula 2000 (2000). Following these two roles, Butler developed quite a fan base, and began appearing on websites and fancasts everywhere.\n\nSince then, he has appeared in Reign of Fire (2002) as \"Creedy\" and Lara Croft: Tomb Raider - The Cradle of Life (2003) as \"Terry Sheridan\", alongside Angelina Jolie. The role that garnered him the most attention from both moviegoers and movie makers, alike, was that of \"Andre Marek\" in the big-screen adaptation of Michael Crichton's novel, Timeline (2003). Butler played an archaeologist who was sent back in time with a team of students to rescue a colleague. Last year, he appeared in Andrew Lloyd Webber's musical, The Phantom of the Opera (2004), playing the title character in the successful adaptation of the stage musical. It was a role that brought him much international attention. Other projects include Dear Frankie (2004), The Game of Their Lives (2005) and Beowulf & Grendel (2005).\n\nIn 2007, he starred as Spartan \"King Leonidas\" in the Warner Bros. production 300 (2006), based on the Frank Miller graphic novel, and Shattered (2007), co-starring Pierce Brosnan and Maria Bello, which aired on network TV under the title, \"Shattered\". He also starred in P.S. I Love You (2007), with Academy Award-winner Hilary Swank.\n\nIn 2007, he appeared in Nim's Island (2008) and RocknRolla (2008), and completed the new Mark Neveldine / Brian Taylor film, Gamer (2009). His next films included The Ugly Truth (2009), co-starring Katherine Heigl, which began filming in April 2008, The Bounty Hunter (2010), How to Train Your Dragon (2010), Chasing Mavericks (2012) and Olympus Has Fallen (2013). In recent years, he has appeared in films such as Gods of Egypt (2016), Geostorm (2017), Den of Thieves (2018), The Vanishing (2018) and Hunter Killer (2018). Butler is related to writer-director Mark Flood."
                }
            }
        }
    }
}