{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0001602",
            "nameText": {
                "text": "Guy Pearce"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm4202613760",
                "url": "https://m.media-amazon.com/images/M/MV5BMTgyNzc2NzY3Nl5BMl5BanBnXkFtZTgwNTMzMzAwMjE@._V1_.jpg",
                "height": 2048,
                "width": 1365
            },
            "bio": {
                "id": "mb0027653",
                "text": {
                    "plainText": "Guy Edward Pearce was born October 5, 1967 in Cambridgeshire, England, UK to Margaret Anne and Stuart Graham Pearce. His father was born in Auckland, New Zealand, to English and Scottish parents, while Guy's mother is English. Pearce and his family initially traveled to Australia for two years, after his father was offered the position of Chief test pilot for the Australian Government. Guy was just 3-years-old. After deciding to stay in Australia and settling in the Victorian city of Geelong, Guy's father was killed 5 years later in an aircraft test flight, leaving Guy's mother, a schoolteacher, to care for him and his older sister, Tracy.\n\nHaving little interest in subjects at school like math or science, Guy favored art, drama and music. He joined local theatre groups at a young age and appeared in such productions as \"The King and I,\" \"Fiddler on the Roof,\" and \"The Wizard of Oz.\" In 1985, just two days after his final high school exam, Guy started a four-year stint as \"Mike Young\" on the popular Aussie soap Neighbours (1985). At age 20, Guy appeared in his first film, Heaven Tonight (1989), then, after a string of appearances in film, television and on the stage, he won the role of an outrageous drag queen in The Adventures of Priscilla, Queen of the Desert (1994).\n\nMost recently, he has amazed film critics and audiences, alike, with his magnificent performances in L.A. Confidential (1997), Memento (2000), The Proposition (2005), Factory Girl (2006), The Hurt Locker (2008), The King's Speech (2010) and the HBO mini-series, Mildred Pierce (2011). Next to acting, Guy has had a life-long passion for music and songwriting.\n\nGuy likes to keep his private life very private. He lives in Melbourne, Australia, which is also where he married his childhood sweetheart, Kate Mestitz in March 1997."
                }
            }
        }
    }
}