{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0005212",
            "nameText": {
                "text": "Ian McKellen"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm230854144",
                "url": "https://m.media-amazon.com/images/M/MV5BMTQ2MjgyNjk3MV5BMl5BanBnXkFtZTcwNTA3NTY5Mg@@._V1_.jpg",
                "height": 400,
                "width": 295
            },
            "bio": {
                "id": "mb0023832",
                "text": {
                    "plainText": "Widely regarded as one of the greatest stage and screen actors both in his native Great Britain and internationally, twice nominated for the Oscar and recipient of every major theatrical award in the UK and US, Ian Murray McKellen was born on May 25, 1939 in Burnley, Lancashire, England, to Margery Lois (Sutcliffe) and Denis Murray McKellen, a civil engineer and lay preacher. He is of Scottish, Northern Irish, and English descent. During his early childhood, his parents moved with Ian and his older sister, Jean, to the mill town of Wigan. It was in this small town that young Ian rode out World War II. He soon developed a fascination with acting and the theatre, which was encouraged by his parents. They would take him to plays, those by William Shakespeare, in particular. The amateur school productions fostered Ian's growing passion for theatre.\n\nWhen Ian was of age to begin attending school, he made sure to get roles in all of the productions. At Bolton School in particular, he developed his skills early on. Indeed, his first role in a Shakespearian play was at Bolton, as Malvolio in \"Twelfth Night\". Ian soon began attending Stratford-upon-Avon theatre festivals, where he saw the greats perform: Laurence Olivier, Wendy Hiller, John Gielgud, Ralph Richardson and Paul Robeson. He continued his education in English Drama, but soon it fell by the wayside as he concentrated more and more on performing. He eventually obtained his Bachelor of Arts in 1961, and began his career in earnest.\n\nMcKellen began working in theatre over the next few years. Very few people knew of Ian's homosexuality; he saw no reason to go public, nor had he told his family. They did not seem interested in the subject and so he saw no reason to bring it up. In 1988, Ian publicly came out of the closet on the BBC Radio 4 program, while discussing Margaret Thatcher's \"Section 28\" legislation, which made the promotion of homosexuality as a family relationship by local authorities an offense. It was reason enough for McKellen to take a stand. He has been active in the gay rights movement ever since.\n\nIan resides in Limehouse, where he has also lived with his former long-time partner Sean Mathias. The two men have also worked together on the film Bent (1997) as well as in exquisite stage productions. To this day, McKellen works mostly in theatre, and was knighted by Queen Elizabeth II in 1990 for his efforts in the arts. However, he has managed to make several quite successful forays into film. He has appeared in several productions of Shakespeare's works including his well received Richard III (1995), and in a variety of other movies. However, it has only been recently that his star has finally begun to shine in the eyes of North American audiences. Roles in various films, Cold Comfort Farm (1995), Apt Pupil (1998) and Gods and Monsters (1998), riveted audiences. The latter, in particular, created a sensation in Hollywood, and McKellen's role garnered him several of awards and nominations, including a Golden Globe and an Oscar nod. McKellen, as he continues to work extensively on stage, he always keeps in 'solidifying' his 'role' as Laurence Olivier's worthy 'successor' in the best sense too, such as King Lear (2008) / King Lear (2008) directed by Trevor Nunn and in a range of other staggering performances full of generously euphoric delight that have included \"Peter Pan\" and Noël Coward's \"Present Laughter\", as well as Samuel Beckett's \"Waiting for Godot\" and Harold Pinter's \"No Man's Land\" (National Theatre Live: No Man's Land (2016)), both in acclaimed productions brilliantly directed by Sean Mathias.\n\nMcKellen found mainstream success with his performance as Magneto in X-Men (2000) and its sequels. His largest mark on the big screen may be as Gandalf in \"The Lord of the Rings\" film trilogy directed by Peter Jackson, which he reprised in \"The Hobbit\" trilogy. He also reprised the role of 'King Lear' with new artistic perspectives in National Theatre Live: King Lear (2018) offering an invaluable mesmerizing experience as a natural force of stage - and screen - of infinite generosity through his unsurpassable interpretation of the titanically vulnerable king."
                }
            }
        }
    }
}