{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000197",
            "nameText": {
                "text": "Jack Nicholson"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm2145949696",
                "url": "https://m.media-amazon.com/images/M/MV5BMTQ3OTY0ODk0M15BMl5BanBnXkFtZTYwNzE4Njc4._V1_.jpg",
                "height": 400,
                "width": 289
            },
            "bio": {
                "id": "mb0174675",
                "text": {
                    "plainText": "Jack Nicholson, an American actor, producer, director and screenwriter, is a three-time Academy Award winner and twelve-time nominee. Nicholson is also notable for being one of two actors - the other being Michael Caine - who have received an Oscar nomination in every decade from the '60s through the '00s.\n\nNicholson was born on April 22, 1937, in Neptune, New Jersey. He was raised believing that his grandmother was his mother, and that his mother, June Frances Nicholson, a showgirl, was his older sister. He discovered the truth in 1975 from a Time magazine journalist who was researching a profile on him. His real father is believed to have been either Donald Furcillo, an Italian American showman, or Eddie King (Edgar Kirschfeld), born in Latvia and also in show business. Jack's mother's ancestry was Irish, and smaller amounts of English, German, Scottish, and Welsh.\n\nNicholson made his film debut in a B-movie titled The Cry Baby Killer (1958). His rise in Hollywood was far from meteoric, and for years, he sustained his career with guest spots in television series and a number of Roger Corman films, including The Little Shop of Horrors (1960).\n\nNicholson's first turn in the director's chair was for Drive, He Said (1971). Before that, he wrote the screenplay for The Trip (1967), and co-wrote Head (1968), a vehicle for The Monkees. His big break came with Easy Rider (1969) and his portrayal of liquor-soaked attorney George Hanson, which earned Nicholson his first Oscar nomination. Nicholson's film career took off in the 1970s with a definitive performance in Five Easy Pieces (1970). Nicholson's other notable work during this period includes leading roles in Roman Polanski's noir masterpiece Chinatown (1974) and One Flew Over the Cuckoo's Nest (1975), for which he won his first Best Actor Oscar.\n\nThe 1980s kicked off with another career-defining role for Nicholson as Jack Torrance in Stanley Kubrick's adaptation of Stephen King's novel The Shining (1980). A string of well-received films followed, including Terms of Endearment (1983), which earned Nicholson his second Oscar; Prizzi's Honor (1985), and The Witches of Eastwick (1987). He portrayed another renowned villain, The Joker, in Tim Burton's Batman (1989). In the 1990s, he starred in such varied films as A Few Good Men (1992), for which he received another Oscar nomination, and a dual role in Mars Attacks! (1996).\n\nAlthough a glimpse at the darker side of Nicholson's acting range reappeared in The Departed (2006), the actor's most recent roles highlight the physical and emotional complications one faces late in life. The most notable of these is the unapologetically misanthropic Melvin Udall in As Good as It Gets (1997), for which he won his third Oscar. Shades of this persona are apparent in About Schmidt (2002), Something's Gotta Give (2003), and The Bucket List (2007). In addition to his Academy Awards and Oscar nominations, Nicholson has seven Golden Globe Awards, and received a Kennedy Center Honor in 2001. He also became one of the youngest actors to receive the American Film Institute's Life Achievement award in 1994.\n\nNicholson has six children by five different women: Jennifer Nicholson (b. 1963) from his only marriage to Sandra Knight, which ended in 1966; Caleb Goddard (b. 1970) with Five Easy Pieces (1970) co-star Susan Anspach, who was automatically adopted by Anspach's then-husband Mark Goddard; Honey Hollman (b. 1982) with Danish supermodel Winnie Hollman; Lorraine Nicholson (b. 1990) and Ray Nicholson (b. 1992) with minor actress Rebecca Broussard; and Tessa Gourin (b. 1994) with real estate agent Jennine Marie Gourin. Nicholson's longest relationship was the 17 nonmonogamous years he spent with Anjelica Huston; this ended when Broussard announced she was pregnant with his child."
                }
            }
        }
    }
}