{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0001337",
            "nameText": {
                "text": "Katherine Heigl"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm3255404544",
                "url": "https://m.media-amazon.com/images/M/MV5BNTM0NDEwMjA1MV5BMl5BanBnXkFtZTcwMzQxMDI3Mg@@._V1_.jpg",
                "height": 400,
                "width": 271
            },
            "bio": {
                "id": "mb0015751",
                "text": {
                    "plainText": "Katherine Marie Heigl was born on November 24, 1978 in Washington, D.C., to Nancy Heigl (née Engelhardt), a personnel manager, and Paul Heigl, an accountant and executive. Her father is of German/Swiss-German and Irish descent, and her mother is of German ancestry. A short time after her birth, the family moved to New Canaan, Connecticut, where Katherine was to spend the majority of her childhood; the youngest member of her family, Katherine--or \"Katie\" as she is nicknamed--has two elder siblings, John and Meg. Tragically, her older brother Jason died in 1986 of brain injuries suffered in a car accident, after being thrown from the back of a pickup truck. When doctors determined he was brain-dead, the family made the difficult decision to donate his organs. Not only did this painful chapter give Katherine a greater perspective and appreciation for life, but it motivated her to use her celebrity to promote the importance of organ donation.\n\nKatherine was first thrust into the limelight as a child model. An aunt, visiting the family in New Canaan, took a number of photographs of Katherine, then aged nine, in a series of poses to advertise a hair care product she had invented. Upon returning to New York, with permission from Katherine's parents, she sent the photos to a number of modeling agencies. Within a few weeks, Katherine had been signed to Wilhelmina, a renowned international modeling agency. Almost immediately, she made her debut in a magazine advertisement and soon followed this with an inaugural television appearance in a national commercial for Cheerios breakfast cereal.\n\nFollowing a number of commercials and modeling assignments for Sears and Lord & Taylor, she made her big-screen debut in That Night (1992), which starred Juliette Lewis and C. Thomas Howell. It was then that she realized that acting rather than modeling was her passion. In 1993, Katherine appeared in Steven Soderbergh's critically-acclaimed Depression-era drama, King of the Hill (1993), before landing her first leading role as a rebellious teenager, alongside Gérard Depardieu, in My Father the Hero (1994). During this time, Katherine continued to attend New Canaan High School, balancing her academic studies with work on films and modeling, which she undertook during holidays, vacations and weekends.\n\nIn 1995, she played \"Sarah Ryback\", the niece of Steven Seagal's character, in Under Siege 2: Dark Territory (1995), which was her \"debut\" in the action film genre. Acting was now becoming a stronger focus for Katherine, although she still modeled extensively, appearing regularly in magazines such as \"Seventeen\". Television appearances on The Tonight Show with Jay Leno (1992) and Late Night with Conan O'Brien (1993) soon followed, before she took the lead role in Disney's Wish Upon a Star (1996) in 1996. It was also during that year that Katherine's parents divorced and, following her graduation from high school in 1997, she moved with her mother into a four-bedroom house in Los Angeles' Malibu Canyon area. This enabled her to focus upon acting with the guidance and support of her mother, who now managed her career.\n\nIn 1997, Katherine portrayed \"Taffy Entwhistle\", Rita Hayworth's stand-in, in Stand-ins (1997) and was also cast as the beauteous \"Princess Ilene\" in the European production, Prince Valiant (1997). She then made her made-for-TV movie debut, co-starring with Peter Fonda in a re-working of the classic Shakespearean play, The Tempest (1998), updated with an American Civil War theme. In this film, she played \"Miranda Prosper\", a young woman torn between her love for both her father and a Union soldier. Bug Buster (1998) and Bride of Chucky (1998) represented a venture into the horror genre for Katherine. While both films could be described as rather tongue-in-cheek despite their gory emphases, Bride of Chucky (1998) was the better received, both critically and commercially.\n\nIn 1999, Katherine decided to branch out into series television when she accepted the role of the haughty, yet vulnerable, \"Isabel Evans\", on Roswell (1999), a show that blended teen angst with sci-fi drama. Though she had never planned to embark on a career in television, the role of Isabel, a teenager with a secret life, was an offer she found impossible to refuse. In the series, Isabel, her brother Max (Jason Behr) and their friend Michael (Brendan Fehr) are aliens passing as humans in Roswell, New Mexico, as they desperately try to hide the truth from government agencies, the people of Roswell and even their own adopted families. To publicize her role on the show, Katherine graced the covers of magazines such as \"TV Guide\", \"Maxim\" and \"Teen\" and was interviewed on Later (1994) and The Late Late Show with Craig Kilborn (1999). Along with her mother Nancy, she also appeared in an episode of the Sci-Fi TV talk show, Crossing Over with John Edward (2001), during which she spoke with John Edward, a psychic medium, about her late brother, Jason. During the three years Roswell (1999) was in production, Katherine found time to work on several movies. 100 Girls (2000), an independent film released in 2001, is the story of a college freshman who meets the girl of his dreams in an elevator during a blackout, and spends the rest of the movie trying to find her again. Her cameo role is that of Arlene, the competitive tomboy. The second film, Valentine (2001), a horror film starring David Boreanaz and Denise Richards, appeared in U.S. theaters on February 2, 2001. In this movie, which is based upon the 1996 novel by Tom Savage, Katherine plays \"Shelley\", a medical student who meets a sudden demise.\n\nIn the spring of 2001, Katherine accepted a role in NBC's Critical Assembly (2002), a two-hour original television thriller. Katherine and Kerr Smith (Dawson's Creek (1998)) co-starred as brilliant and politically concerned college students who build a nuclear device to illustrate the need for a change in national priorities, but are betrayed by a fellow student when the bomb ends up in the hands of a terrorist. Unfortunately, the telefilm, directed by Eric Laneuville, written by Tom Vaughan, and based on the best-seller \"The Seventh Power\" by James Mills, was shelved when its storyline was deemed too close for comfort to the events of September 11, 2001. It was eventually broadcast in 2003. Since the cancellation of Roswell (1999) in the spring of 2002, Katherine has been busy with various projects, including an appearance on UPN's update of the classic television series, The Twilight Zone (2002). That episode, entitled Cradle of Darkness (2002), aired on October 2, 2002, and featured Katherine in the role of a woman who goes back in time to stop one of the most notorious murders in history. In addition, she completed a movie, Descendant (2003), a psychological thriller inspired by Edgar Allan Poe's \"The Fall of the House of Usher\". She has also starred as \"Romy\" in ABC/Touchstone's two-hour telepic, Romy and Michele: In the Beginning (2005), a prequel to the 1997 feature, Romy and Michele's High School Reunion (1997). During the summer of 2002, Katherine made a major decision in the direction of her career when she signed on for representation in all areas with the William Morris Agency, one of the biggest and most prestigious agencies in the entertainment industry. She is now being represented by Norman Aladjem at Paradigm Agency and being managed by Nancy Heigl and Stephanie Simon and Jason Newman at Untitled Entertainment."
                }
            }
        }
    }
}