{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000228",
            "nameText": {
                "text": "Kevin Spacey"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm1382175232",
                "url": "https://m.media-amazon.com/images/M/MV5BMTY1NzMyODc3Nl5BMl5BanBnXkFtZTgwNzE2MzA1NDM@._V1_.jpg",
                "height": 1471,
                "width": 1800
            },
            "bio": {
                "id": "mb0033571",
                "text": {
                    "plainText": "Kevin Spacey Fowler, better known by his stage name Kevin Spacey, is an American actor of screen and stage, film director, producer, screenwriter and singer. He began his career as a stage actor during the 1980s before obtaining supporting roles in film and television. He gained critical acclaim in the early 1990s that culminated in his first Academy Award for Best Supporting Actor for the neo-noir crime thriller The Usual Suspects (1995), and an Academy Award for Best Actor for midlife crisis-themed drama American Beauty (1999).\n\nHis other starring roles have included the comedy-drama film Swimming with Sharks (1994), psychological thriller Seven (1995), the neo-noir crime film L.A. Confidential (1997), the drama Pay It Forward (2000), the science fiction-mystery film K-PAX (2001)\n\nIn Broadway theatre, Spacey won a Tony Award for his role in Lost in Yonkers. He was the artistic director of the Old Vic theatre in London from 2004 until stepping down in mid-2015. Since 2013, Spacey has played Frank Underwood in the Netflix political drama series House of Cards. His work in House of Cards earned him Golden Globe Award and Emmy Award nominations for Best Actor.\n\nAs enigmatic as he is talented, Kevin Spacey for years kept the details of his private life closely guarded. As he explained in a 1998 interview with the London Evening Standard, \"the less you know about me, the easier it is to convince you that I am that character on screen. It allows an audience to come into a movie theatre and believe I am that person\". In October 2017, he ended many years of media speculation about his personal life by confirming that he had had sexual relations with both men and women but now identified as gay.\n\nThere are, however, certain biographical facts to be had - for starters, Kevin Spacey Fowler was the youngest of three children born to Kathleen Ann (Knutson) and Thomas Geoffrey Fowler, in South Orange, New Jersey. His ancestry includes Swedish (from his maternal grandfather) and English. His middle name, \"Spacey,\" which he uses as his stage name, is from his paternal grandmother. His mother was a personal secretary, his father a technical writer whose irregular job prospects led the family all over the country. The family eventually settled in southern California, where young Kevin developed into quite a little hellion - after he set his sister's tree house on fire, he was shipped off to the Northridge Military Academy, only to be thrown out a few months later for pinging a classmate on the head with a tire. Spacey then found his way to Chatsworth High School in the San Fernando Valley, where he managed to channel his dramatic tendencies into a successful amateur acting career. In his senior year, he played \"Captain von Trapp\" opposite classmate Mare Winningham's \"Maria\" in \"The Sound of Music\" (the pair later graduated as co-valedictorians). Spacey claims that his interest in acting - and his nearly encyclopedic accumulation of film knowledge - began at an early age, when he would sneak downstairs to watch the late late show on TV. Later, in high school, he and his friends cut class to catch revival films at the NuArt Theater. The adolescent Spacey worked up celebrity impersonations (James Stewart and Johnny Carson were two of his favorites) to try out on the amateur comedy club circuit.\n\nHe briefly attended Los Angeles Valley College, then left (on the advice of another Chatsworth classmate, Val Kilmer) to join the drama program at Juilliard. After two years of training he was anxious to work, so he quit Juilliard sans diploma and signed up with the New York Shakespeare Festival. His first professional stage appearance was as a messenger in the 1981 production of \"Henry VI\".\n\nFestival head Joseph Papp ushered the young actor out into the \"real world\" of theater, and the next year Spacey made his Broadway debut in Henrik Ibsen's \"Ghosts\". He quickly proved himself as an energetic and versatile performer (at one point, he rotated through all the parts in David Rabe's \"Hurlyburly\"). In 1986, he had the chance to work with his idol and future mentor, Jack Lemmon, on a production of Eugene O'Neill's \"Long Day's Journey Into Night\". While his interest soon turned to film, Spacey would remain active in the theater community - in 1991, he won a Tony Award for his turn as \"Uncle Louie\" in Neil Simon's Broadway hit \"Lost in Yonkers\" and, in 1999, he returned to the boards for a revival of O'Neill's \"The Iceman Cometh\".\n\nSpacey's film career began modestly, with a small part as a subway thief in Heartburn (1986). Deemed more of a \"character actor\" than a \"leading man\", he stayed on the periphery in his next few films, but attracted attention for his turn as beady-eyed villain \"Mel Profitt\" on the TV series Wiseguy (1987). Profitt was the first in a long line of dark, manipulative characters that would eventually make Kevin Spacey a household name: he went on to play a sinister office manager in Glengarry Glen Ross (1992), a sadistic Hollywood exec in Swimming with Sharks (1994), and, most famously, creepy, smooth-talking eyewitness Verbal Kint in The Usual Suspects (1995).\n\nThe \"Suspects\" role earned Spacey an Oscar for Best Supporting Actor and catapulted him into the limelight. That same year, he turned in another complex, eerie performance in David Fincher's thriller Se7en (1995) (Spacey refused billing on the film, fearing that it might compromise the ending if audiences were waiting for him to appear). By now, the scripts were pouring in. After appearing in Al Pacino's Looking for Richard (1996), Spacey made his own directorial debut with Albino Alligator (1996), a low-key but well received hostage drama. He then jumped back into acting, winning critical accolades for his turns as flashy detective Jack Vincennes in L.A. Confidential (1997) and genteel, closeted murder suspect Jim Williams in Midnight in the Garden of Good and Evil (1997). In October 1999, just four days after the dark suburban comedy American Beauty (1999) opened in US theaters, Spacey received a star on the Hollywood Walk of Fame. Little did organizers know that his role in Beauty would turn out to be his biggest success yet - as Lester Burnham, a middle-aged corporate cog on the brink of psychological meltdown, he tapped into a funny, savage character that captured audiences' imaginations and earned him a Best Actor Oscar.\n\nNo longer relegated to offbeat supporting parts, Spacey seems poised to redefine himself as a Hollywood headliner. He says he's finished exploring the dark side - but, given his attraction to complex characters, that mischievous twinkle will never be too far from his eyes.\n\nIn February 2003 Spacey made a major move back to the theatre. He was appointed Artistic Director of the new company set up to save the famous Old Vic theatre, The Old Vic Theatre Company. Although he did not undertake to stop appearing in movies altogether, he undertook to remain in this leading post for ten years, and to act in as well as to direct plays during that time. His first production, of which he was the director, was the September 2004 British premiere of the play Cloaca by Maria Goos (made into a film, Cloaca (2003)). Spacey made his UK Shakespearean debut in the title role in Richard II in 2005. In 2006 he got movie director Robert Altman to direct for the stage the little-known Arthur Miller play Resurrection Blues, but that was a dismal failure. However Spacey remained optimistic, and insisted that a few mistakes are part of the learning process. He starred thereafter with great success in Eugene O'Neill's A Moon for the Misbegotten along with Colm Meaney and Eve Best, and in 2007 that show transferred to Broadway. In February 2008 Spacey put on a revival of the David Mamet 1988 play Speed-the-Plow in which he took one of the three roles, the others being taken by Jeff Goldblum and Laura Michelle Kelly.\n\nIn 2013, Spacey took on the lead role in an original Netflix series, House of Cards (2013). Based upon a British show of the same name, House of Cards is an American political drama. The show's first season received a Primetime Emmy Award nomination to include Outstanding lead actor in a drama series. In 2017, he played a memorable role as a villain in the action thriller Baby Driver (2017)."
                }
            }
        }
    }
}