{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000212",
            "nameText": {
                "text": "Meg Ryan"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm3711566592",
                "url": "https://m.media-amazon.com/images/M/MV5BMTgzOTI0NzI3OV5BMl5BanBnXkFtZTgwODIyMzUzMDI@._V1_.jpg",
                "height": 713,
                "width": 487
            },
            "bio": {
                "id": "mb0031009",
                "text": {
                    "plainText": "Blonde-haired, blue-eyed with an effervescent personality, Meg Ryan was born Margaret Mary Emily Anne Hyra in Fairfield, Connecticut, to Susan (Duggan), an English teacher and one-time actress, and Harry Hyra, a math teacher. She is of Ruthenian, Polish, Irish, and German ancestry (\"Hyra\" is a Ruthenian surname, and \"Ryan\" is her maternal grandmother's maiden name). Meg graduated from Bethel high school in June 1979. Moving to New York, she attended New York University where she majored in journalism. To earn extra money while working on her degree, Meg went into acting using her new name Meg Ryan. In 1981, she had her big screen debut with a brief appearance as Candice Bergen's daughter in George Cukor's last film Rich and Famous (1981).\n\nShe tried out and was cast as Betsy in the day time television soap As the World Turns (1956). She was part of the cast from 1982 to 1984. Meg also had a part in the television series One of the Boys (1982), but this show was soon canceled. In 1984, she moved to tinsel town and landed a job in the western television Series Wildside (1985). Meg's small part in the blockbuster movie Top Gun (1986) led to her being cast in Innerspace (1987) where she co-starred with Dennis Quaid. She again co-starred with Quaid in the remake of D.O.A. (1988) and they married on Saint Valentine's Day in 1991. In 1989, Meg appeared in When Harry Met Sally... (1989) and the scene at the restaurant became famous. Meg was nominated for both the Golden Globe and the BAFTA.\n\nIn 1990, she co-starred with Tom Hanks in Joe Versus the Volcano (1990) and this time she played three roles as DeDe/Angelica/Patricia. She appeared again with Tom in the very successful Sleepless in Seattle (1993) for which she was again nominated for the Golden Globe. In 1994, Meg decided to act against type when she appeared as the alcoholic wife and mother in When a Man Loves a Woman (1994). After that, she went back to \"cute\" with both I.Q. (1994) and French Kiss (1995). In 1994, Meg won the Harvard Hasty Pudding Award as \"Woman of the Year\" and was voted as being one of \"The 50 most beautiful people in the world 1994\" by People Magazine."
                }
            }
        }
    }
}