{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000115",
            "nameText": {
                "text": "Nicolas Cage"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm757971456",
                "url": "https://m.media-amazon.com/images/M/MV5BMjUxMjE4MTQxMF5BMl5BanBnXkFtZTcwNzc2MDM1NA@@._V1_.jpg",
                "height": 2048,
                "width": 1503
            },
            "bio": {
                "id": "mb0005265",
                "text": {
                    "plainText": "Nicolas Cage was born Nicolas Kim Coppola in Long Beach, California, the son of comparative literature professor August Coppola (whose brother is director Francis Ford Coppola) and dancer/choreographer Joy Vogelsang. He is of Italian (father) and Polish and German (mother) descent. Cage changed his name early in his career to make his own reputation, succeeding brilliantly with a host of classic, quirky roles by the late 1980s.\n\nInitially studying theatre at Beverly Hills High School (though he dropped out at seventeen), he secured a bit part in Fast Times at Ridgemont High (1982) - most of which was cut, dashing his hopes and leading to a job selling popcorn at the Fairfax Theater, thinking that would be the only route to a movie career, but a job reading lines with actors auditioning for uncle Francis's Rumble Fish (1983) landed him a role in that film, followed by the romantic lead in Valley Girl (1983), which was released first and truly launched his career.\n\nHis one-time passion for method acting reached a personal limit when he smashed a street-vendor's remote-control car to achieve the sense of rage needed for his gangster character in The Cotton Club (1984).\n\nIn his early 20s, he dated Jenny Wright for two years and later linked to Uma Thurman. After a relationship of several years with Christina Fulton, a model, they split amicably and share custody of a son, Weston Cage (b. 1990). He also has a son with his ex-wife, Alice Kim Cage."
                }
            }
        }
    }
}