{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000173",
            "nameText": {
                "text": "Nicole Kidman"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm328971520",
                "url": "https://m.media-amazon.com/images/M/MV5BMTk1MjM5NDg4MF5BMl5BanBnXkFtZTcwNDg1OTQ4Nw@@._V1_.jpg",
                "height": 1902,
                "width": 1404
            },
            "bio": {
                "id": "mb0019203",
                "text": {
                    "plainText": "Elegant blonde Nicole Kidman, known as one of Hollywood's top Australian imports, was actually born in Honolulu, Hawaii to Anthony (a biochemist and clinical psychologist) and Janelle (a nursing instructor) Kidman. The family moved almost immediately to Washington, D.C., where Nicole's father pursued his research on breast cancer, then, three years later, made the pilgrimage to her parents' native Sydney. Young Nicole's first love was ballet, but she eventually took up mime and drama as well (her first stage role was a bleating sheep in an elementary school Christmas pageant). In her adolescent years, acting edged out the other arts and became a kind of refuge - as her classmates sought out fun in the sun, the fair-skinned Kidman retreated to dark rehearsal halls to practice her craft. She worked regularly at the Philip Street Theater, where she once received a personal letter of praise and encouragement from audience member Jane Campion (then a film student). Kidman eventually dropped out of high school to pursue acting full-time. She broke into movies at age 16, landing a role in the Australian holiday favorite Bush Christmas (1983). That appearance touched off a flurry of film and television offers, including a lead in BMX Bandits (1983) and a turn as a schoolgirl-turned-protester in the miniseries Vietnam (1987) (for which she won her first Australian Film Institute Award). With the help of an American agent, she eventually made her US debut opposite Sam Neill in the at-sea thriller Dead Calm (1989).\n\nKidman's next casting coup scored her more than exposure. While starring as Tom Cruise's doctor/love interest in the racetrack romance Days of Thunder (1990), she won over the Hollywood hunk hook, line and sinker. After a whirlwind courtship (and decent box office returns), the couple wed on December 24, 1990. Determined not to let her new marital status overshadow her fledgling career, the actress pressed on. She appeared as a catty high school senior in the Australian film Flirting (1991), then as Dustin Hoffman's moll in the gangster flick Billy Bathgate (1991). She reunited with Cruise for Far and Away (1992), the story of young Irish lovers who flee to America in the late 1800s, and starred opposite Michael Keaton in the tear-tugger My Life (1993). Despite her steady employment, critics and moviegoers still had not quite warmed to Kidman as a leading lady. She tried to spice up her image by seducing Val Kilmer in Batman Forever (1995), but achieved her real breakthrough with Gus Van Sant's To Die For (1995). As a fame-crazed housewife determined to eliminate any obstacle in her path, Kidman proved that she had an impressive range and deadly comic timing. She took home a Golden Globe and several critics' awards for the performance. In 1996, Kidman stepped into a corset to work with her countrywoman and onetime admirer, Jane Campion, on the adaptation of Henry James's The Portrait of a Lady (1996). A few months later, she tore across the screen as a nuclear weapons expert in The Peacemaker (1997), adding \"action star\" to her professional repertoire.\n\nShe and Cruise then disappeared into a notoriously long, secretive shoot for Stanley Kubrick's sexual thriller Eyes Wide Shut (1999). The couple's on-screen shenanigans prompted an increase in public speculation about their sex life (rumors had long been circulating that their marriage was a cover-up for Cruise's rumored homosexuality); tired of denying tabloid attacks, they successfully sued The Star for a story alleging that they needed a sex therapist to coach them through love scenes. Family life has always been a priority for Kidman. Born to social activists (mother was a feminist; father, a labor advocate), Nicole and her little sister, Antonia Kidman, discussed current events around the dinner table and participated in their parents' campaigns by passing out pamphlets on street corners. When her mother was diagnosed with breast cancer, 17-year-old Nicole stopped working and took a massage course so that she could provide physical therapy (her mother eventually beat the cancer). She and Cruise adopted two children: Isabella Jane (born 1992) and Connor Antony (born 1995). Despite their rock-solid image, the couple announced in early 2001 that they were separating due to career conflicts. Her marriage to Cruise ended mid-summer of 2001."
                }
            }
        }
    }
}