{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000152",
            "nameText": {
                "text": "Richard Gere"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm2832571136",
                "url": "https://m.media-amazon.com/images/M/MV5BMTI2NDQ2OTY4M15BMl5BanBnXkFtZTYwNTYyNjc4._V1_.jpg",
                "height": 400,
                "width": 281
            },
            "bio": {
                "id": "mb0013141",
                "text": {
                    "plainText": "Humanitarian and actor Richard Gere was born on August 31, 1949, in Philadelphia, the second of five children of Doris Anna (Tiffany), a homemaker, and Homer George Gere, an insurance salesman, both Mayflower descendants. Richard started early as a musician, playing a number of instruments in high school and writing music for high school productions. He graduated from North Syracuse Central High School in 1967, and won a gymnastics scholarship to the University of Massachusetts in Amherst, where he majored in philosophy. He left college after two years to pursue acting, landing a lead role in the London production of the rock musical \"Grease\" in 1973. The following year he would be in other plays, such as \"Taming of the Shrew.\" Onscreen, he had a few roles, and gained recognition in Looking for Mr. Goodbar (1977). Offscreen, he spent 1978 meeting Tibetans when he traveled to Nepal, where he spoke to many monks and lamas. Returning to the US, on Broadway he portrayed a concentration-camp prisoner in \"Bent,\" for which he received the 1980 Theatre World Award. Back in Hollywood, he played the title role in American Gigolo (1980), establishing himself as a major star; this status was reaffirmed by An Officer and a Gentleman (1982). In the early 1980s, Richard went to Honduras, Nicaragua and El Salvador (amidst ongoing wars and political violence); he traveled with a doctor and visited refugee camps. It is said that Richard was romantically linked with Tuesday Weld, Priscilla Presley, Barbra Streisand and Kim Basinger. In 1990 Richard teamed up with Julia Roberts to star in the blockbuster Pretty Woman (1990); his cool reserve was the perfect complement to Julia's bubbling enthusiasm. The film captured the nation's heart, and won the People's Choice award for Best Movie. Fans clamored for years for a sequel, or at least another pairing of Julia and Richard. They got that with Runaway Bride (1999), which was a runaway success (Richard got $12 million, Julia made $17 million, the box office was $152 million, which shows what happens when you give the public what it wants!). Offscreen, Richard and Cindy Crawford got married December 12, 1991 (they were divorced in 1995). Afterwards, Richard started dating actress Carey Lowell. They had a son, Homer James Jigme Gere, on February 6, 2000. Richard was picked by People magazine as one of the 50 Most Beautiful People in the world in 1991, and as their Sexiest Man Alive in 1999. He is an accomplished pianist and music writer. Above all, Richard is a humanitarian. He's a founding member of \"Tibet House,\" a nonprofit organization dedicated to the preservation of Tibetan culture. He has been an active supporter of \"Survival International\" for several years, a worldwide organization supporting tribal peoples, affirming their right to decide their own future and helping them protect their lives, lands and human rights (these tribes are global, including the natives of the Amazon, the Maasai of East Africa, the Wichi of Argentina, and others). In 1994 Richard went to London to open Harrods' sale, donating his £50,000 appearance fee to Survival. He has been prominent in their charity advertising campaigns."
                }
            }
        }
    }
}