{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000113",
            "nameText": {
                "text": "Sandra Bullock"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm185241344",
                "url": "https://m.media-amazon.com/images/M/MV5BMTI5NDY5NjU3NF5BMl5BanBnXkFtZTcwMzQ0MTMyMw@@._V1_.jpg",
                "height": 600,
                "width": 409
            },
            "bio": {
                "id": "mb0004887",
                "text": {
                    "plainText": "Sandra Annette Bullock was born in Arlington, a Virginia suburb of Washington, D.C. Her mother, Helga Bullock (née Helga Mathilde Meyer), was a German opera singer. Her father, John W. Bullock, was an American voice teacher, who was born in Alabama, of German descent. Sandra grew up on the road with her parents and younger sister, chef Gesine Bullock-Prado, and spent much of her childhood in Nuremberg, Germany. She often performed in the children's chorus of whatever production her mother was in. That singing talent later came in handy for her role as an aspiring country singer in The Thing Called Love (1993). Her family moved back to the Washington area when she was adolescent. She later enrolled in East Carolina University in North Carolina, where she studied acting. Shortly afterward she moved to New York to pursue a career on the stage. This led to acting in television programs and then feature films. She gave memorable performances in Demolition Man (1993) and Wrestling Ernest Hemingway (1993), but did not achieve the stardom that seemed inevitable for her until her work in the smash hit Speed (1994). She now ranks as one of the most popular actresses in Hollywood. For her role in The Blind Side (2009) she won the Oscar, and her blockbusters The Proposal (2009), The Heat (2013) and Gravity (2013) made her a bankable star. With $56,000,000, she was listed in the Guinness Book Of World Records as the highest-paid actress in the world."
                }
            }
        }
    }
}