{
    "data": {
        "name": {
            "__typename": "Name",
            "id": "nm0000125",
            "nameText": {
                "text": "Sean Connery"
            },
            "primaryImage": {
                "__typename": "Image",
                "id": "rm1461980928",
                "url": "https://m.media-amazon.com/images/M/MV5BY2I3NDEyYjgtMDkzZS00YWUzLTk1ZGUtYmRlODc1ZDAyYjQ4XkEyXkFqcGc@._V1_.jpg",
                "height": 1800,
                "width": 1403
            },
            "bio": {
                "id": "mb0067082",
                "text": {
                    "plainText": "The tall, handsome and muscular Scottish actor Sean Connery is best known as the original actor to portray James Bond in the hugely successful movie franchise, starring in seven films between 1962 and 1983. Some believed that such a career-defining role might leave him unable to escape it, but he proved the doubters wrong, becoming one of the most notable film actors of his generation, with a host of great movies to his name. This arguably culminated in his greatest acclaim in 1988, when Connery won the Academy Award for Best Supporting Actor for his role as an Irish cop in The Untouchables (1987), stealing the thunder from the movie's principal star Kevin Costner. Connery was polled as \"The Greatest Living Scot\" and \"Scotland's Greatest Living National Treasure.\" In 1989, he was proclaimed \"Sexiest Man Alive\" by People magazine, and in 1999, at age 69, he was proclaimed \"Sexiest Man of the Century.\"\n\nThomas \"Sean\" Connery was born on August 25, 1930 in Fountainbridge, Edinburgh. His mother, Euphemia Maclean, was a cleaning lady, and his father, Joseph Connery, was a factory worker and truck driver. He also had a brother, Neil Connery, a plasterer in Edinburgh, who was eight years younger. Before going into acting, Sean had many different jobs, such as a milkman, lorry driver, a laborer, artist's model for the Edinburgh College of Art, coffin polisher and bodybuilder. He also joined the Royal Navy, but was later discharged because of medical problems. At the age of 23, he had a choice between becoming a professional soccer player or an actor, and even though he showed much promise in the sport, he chose acting and said it was one of his more intelligent decisions.\n\nNo Road Back (1957) was Sean's first major movie role, and it was followed by several made-for-TV movies such as Anna Christie (1957), Macbeth (1961) and Anna Karenina (1961) as well as guest appearances on TV series, and also films such as Hell Drivers (1957), Another Time, Another Place (1958), Darby O'Gill and the Little People (1959) and The Frightened City (1961). In 1962 he appeared in The Longest Day (1962) with a host of other stars.\n\nHis big breakthrough came in 1962 when he landed the role of secret agent James Bond in Dr. No (1962). He played James Bond in six more films: From Russia with Love (1963), Goldfinger (1964), Thunderball (1965), You Only Live Twice (1967), Diamonds Are Forever (1971) and Never Say Never Again (1983).\n\nAfter and during the success of the Bond films, he maintained a successful career as an actor and has appeared in films, including Alfred Hitchcock's Marnie (1964), The Hill (1965), Murder on the Orient Express (1974), The Man Who Would Be King (1975), The Wind and the Lion (1975), Time Bandits (1981), Highlander (1986), The Name of the Rose (1986), Indiana Jones and the Last Crusade (1989), The Hunt for Red October (1990), Rising Sun (1993), The Rock (1996), Finding Forrester (2000) and The League of Extraordinary Gentlemen (2003).\n\nSean married actress Diane Cilento in 1962 and they had Sean's only child, Jason Connery, born on January 11, 1963. The couple announced their separation in February 1971 and filed for divorce 2½ years later. Sean then dated Jill St. John, Lana Wood, Magda Konopka and Carole Mallory. In 1975 he married Micheline Roquebrune and they stayed married, despite Sean's well-documented love affair with Lynsey de Paul in the late '80s. Sean had three stepchildren through his marriage to Micheline, who was one year his senior. He is also a grandfather. His son, Jason and Jason's ex-wife, actress Mia Sara had a son, Dashiell Connery, in 1997.\n\nSean Connery died at the age of 90 on October 31, 2020, in Nassau, the Bahamas, where he resided for many years."
                }
            }
        }
    }
}